CSI API ETABS v1

# cOAPIApplicationExit Method

---

Exits the application.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int ApplicationExit(
    	bool FileSave
    )

    Function ApplicationExit (
    	FileSave As Boolean
    ) As Integer

    Dim instance As cOAPI
    Dim FileSave As Boolean
    Dim returnValue As Integer

    returnValue = instance.ApplicationExit(FileSave)

    int ApplicationExit(
    	bool FileSave
    )

    abstract ApplicationExit :
            FileSave : bool -> int

#### Parameters

FileSave

    Type: SystemBoolean
If this item is True the existing model file is saved prior to closing the
application.

#### Return Value

Type: Int32
This function returns zero if the function succeeds and nonzero if it fails.

Remarks

If the model file is saved then it is saved with its current name. Any
instance of cSapModel should be
set to nothing after calling this function.

Examples

VB

Copy

    Public Sub Example()
           Dim SapModel As cSapModel
           Dim EtabsObject As cOAPI
           Dim ret As Integer = -1

       'create ETABS object
           Dim myHelper as cHelper = New Helper
           EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

       'start ETABS application
           ret = EtabsObject.ApplicationStart()

       'close ETABS
           EtabsObject.ApplicationExit(False)

       'clean up variables
           SapModel = Nothing
           EtabsObject = Nothing
       End Sub

See Also

#### Reference

cOAPI Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com